In [1]:
import pandas as pd

In [2]:
sal = pd.read_csv('data_files/salaries.csv')

In [3]:
sal.head(2)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN

In [4]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 90000 entries, 0 to 89999
Data columns (total 13 columns):
Id                  90000 non-null int64
EmployeeName        90000 non-null object
JobTitle            90000 non-null object
BasePay             89997 non-null float64
OvertimePay         90000 non-null float64
OtherPay            90000 non-null float64
Benefits            53841 non-null float64
TotalPay            90000 non-null float64
TotalPayBenefits    90000 non-null float64
Year                90000 non-null int64
Notes               0 non-null float64
Agency              90000 non-null object
Status              0 non-null float64
dtypes: float64(8), int64(2), object(3)
memory usage: 8.9+ MB

In [5]:
sal['BasePay'].mean()

72544.57047613862

In [6]:
sal['OvertimePay'].max()

245131.88

In [7]:
sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [8]:
sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [9]:
sal[sal['TotalPayBenefits'] == sal['TotalPayBenefits'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [10]:
sal.iloc[sal['TotalPayBenefits'].idxmax()]['EmployeeName']

'NATHANIEL FORD'

#### Sum of Base Pay by Agency

In [11]:
sal.groupby('Agency').mean()['BasePay']

Agency
San Francisco    72544.570476
Name: BasePay, dtype: float64

In [12]:
sal.groupby('Year').mean()['BasePay']

Year
2011     63595.956517
2012     65436.406857
2013    106806.032271
Name: BasePay, dtype: float64

In [13]:
import seaborn as sns

In [14]:
tips = sns.load_dataset('tips')

In [15]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [0]:
tips.head(10)